<?xml version="1.0" ?>
<net batch="1" name="tf_model_8960_fp16" version="6">
	<layers>
		<layer id="0" name="inputs" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1d_1/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="2" name="conv1d_1/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv1d_1/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1d_1/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4" size="1024"/>
			</blobs>
		</layer>
		<layer id="5" name="conv1d_1/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1d_1/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="7" name="conv1d_1/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_mul_11941/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1028" size="64"/>
			</blobs>
		</layer>
		<layer id="9" name="batch_normalization_1/cond/batchnorm/mul_1/Fused_Mul_" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_11943_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1092" size="64"/>
			</blobs>
		</layer>
		<layer id="11" name="conv1d_1/add/Fused_Add_" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="activation_1/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="max_pooling1d_1/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="14" name="max_pooling1d_1/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="max_pooling1d_1/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="max_pooling1d_1/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="max_pooling1d_1/MaxPool/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="max_pooling1d_1/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="max_pooling1d_1/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv1d_2/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="21" name="conv1d_2/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv1d_2/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv1d_2/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1160" size="32768"/>
			</blobs>
		</layer>
		<layer id="24" name="conv1d_2/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv1d_2/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="26" name="conv1d_2/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_mul_1194511949/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="33928" size="64"/>
			</blobs>
		</layer>
		<layer id="28" name="batch_normalization_2/cond/batchnorm/mul_1/Fused_Mul_" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_1194611951_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="33992" size="64"/>
			</blobs>
		</layer>
		<layer id="30" name="conv1d_2/add/Fused_Add_" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="activation_2/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv1d_3/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="33" name="conv1d_3/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv1d_3/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv1d_3/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34056" size="32768"/>
			</blobs>
		</layer>
		<layer id="36" name="conv1d_3/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv1d_3/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="38" name="conv1d_3/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv1d_3/Reshape/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="66824" size="64"/>
			</blobs>
		</layer>
		<layer id="40" name="conv1d_3/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="add_1/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="max_pooling1d_2/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="43" name="max_pooling1d_2/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="max_pooling1d_2/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="max_pooling1d_2/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,1" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>8960</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="max_pooling1d_2/MaxPool/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="max_pooling1d_2/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="48" name="max_pooling1d_2/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="batch_normalization_3/cond/batchnorm/mul/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="66888" size="64"/>
			</blobs>
		</layer>
		<layer id="50" name="batch_normalization_3/cond/batchnorm/mul_1" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="batch_normalization_3/cond/batchnorm/sub/add_/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="66952" size="64"/>
			</blobs>
		</layer>
		<layer id="52" name="batch_normalization_3/cond/batchnorm/add_1" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="activation_3/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv1d_4/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="55" name="conv1d_4/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv1d_4/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8960</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv1d_4/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,7" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>8960</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
			<blobs>
				<weights offset="67016" size="32768"/>
			</blobs>
		</layer>
		<layer id="58" name="conv1d_4/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv1d_4/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="60" name="conv1d_4/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_mul_1195311957/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="99784" size="64"/>
			</blobs>
		</layer>
		<layer id="62" name="batch_normalization_4/cond/batchnorm/mul_1/Fused_Mul_" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="data_add_1195411959_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="99848" size="64"/>
			</blobs>
		</layer>
		<layer id="64" name="conv1d_4/add/Fused_Add_" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="activation_4/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv1d_5/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="conv1d_5/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv1d_5/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv1d_5/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
			<blobs>
				<weights offset="99912" size="32768"/>
			</blobs>
		</layer>
		<layer id="70" name="conv1d_5/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv1d_5/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="72" name="conv1d_5/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv1d_5/Reshape/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="132680" size="64"/>
			</blobs>
		</layer>
		<layer id="74" name="conv1d_5/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="add_2/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="max_pooling1d_3/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="77" name="max_pooling1d_3/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="max_pooling1d_3/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="max_pooling1d_3/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="1,1" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="max_pooling1d_3/MaxPool/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="max_pooling1d_3/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="82" name="max_pooling1d_3/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="batch_normalization_5/cond/batchnorm/mul/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="132744" size="64"/>
			</blobs>
		</layer>
		<layer id="84" name="batch_normalization_5/cond/batchnorm/mul_1" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="batch_normalization_5/cond/batchnorm/sub/add_/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="132808" size="64"/>
			</blobs>
		</layer>
		<layer id="86" name="batch_normalization_5/cond/batchnorm/add_1" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="activation_5/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv1d_6/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="89" name="conv1d_6/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv1d_6/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv1d_6/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
			<blobs>
				<weights offset="132872" size="32768"/>
			</blobs>
		</layer>
		<layer id="92" name="conv1d_6/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="conv1d_6/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="94" name="conv1d_6/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="data_mul_1196111965/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="165640" size="64"/>
			</blobs>
		</layer>
		<layer id="96" name="batch_normalization_6/cond/batchnorm/mul_1/Fused_Mul_" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="data_add_1196211967_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="165704" size="64"/>
			</blobs>
		</layer>
		<layer id="98" name="conv1d_6/add/Fused_Add_" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="activation_6/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv1d_7/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="101" name="conv1d_7/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="conv1d_7/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv1d_7/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
			<blobs>
				<weights offset="165768" size="32768"/>
			</blobs>
		</layer>
		<layer id="104" name="conv1d_7/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="conv1d_7/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="106" name="conv1d_7/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="conv1d_7/Reshape/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="198536" size="64"/>
			</blobs>
		</layer>
		<layer id="108" name="conv1d_7/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="add_3/add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="max_pooling1d_4/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="111" name="max_pooling1d_4/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="max_pooling1d_4/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="max_pooling1d_4/MaxPool" precision="FP16" type="Pooling">
			<data auto_pad="valid" exclude-pad="true" kernel="2,1" pads_begin="0,0" pads_end="0,0" pool-method="max" strides="2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4480</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>2240</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="max_pooling1d_4/MaxPool/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>2240</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="max_pooling1d_4/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1156" size="4"/>
			</blobs>
		</layer>
		<layer id="116" name="max_pooling1d_4/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="batch_normalization_7/cond/batchnorm/mul/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="198600" size="64"/>
			</blobs>
		</layer>
		<layer id="118" name="batch_normalization_7/cond/batchnorm/mul_1" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="batch_normalization_7/cond/batchnorm/sub/add_/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="198664" size="64"/>
			</blobs>
		</layer>
		<layer id="120" name="batch_normalization_7/cond/batchnorm/add_1" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="activation_7/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="conv1d_8/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="123" name="conv1d_8/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="conv1d_8/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4480</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="conv1d_8/convolution/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,16" output="32" pads_begin="0,7" pads_end="0,7" strides="1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>4480</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2240</dim>
				</port>
			</output>
			<blobs>
				<weights offset="198728" size="32768"/>
			</blobs>
		</layer>
		<layer id="126" name="conv1d_8/convolution/Conv2D/Transpose" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2240</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="conv1d_8/convolution/Squeeze/Dims/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="128" name="conv1d_8/convolution/Squeeze" precision="FP16" type="Squeeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="data_mul_1196911973/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="231496" size="64"/>
			</blobs>
		</layer>
		<layer id="130" name="batch_normalization_8/cond/batchnorm/mul_1/Fused_Mul_" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="data_add_1197011975_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<custom offset="231560" size="64"/>
			</blobs>
		</layer>
		<layer id="132" name="conv1d_8/add/Fused_Add_" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="activation_8/Relu" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="conv1d_9/convolution/ExpandDims/dim/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="4"/>
			</blobs>
		</layer>
		<layer id="135" name="conv1d_9/convolution/ExpandDims" precision="FP16" type="Unsqueeze">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="conv1d_9/convolution/ExpandDims/Transpose" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2240</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>2240</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="conv1d_9/convolution/Conv2D" precision="FP16" type="Convolution">
